In [1]:
import pandas as pd

print("Pandas versiyon:", pd.__version__)

Pandas versiyon: 2.2.3

In [3]:
#Series
s = pd.Series([10, 20, 30, 40], name = "Numbers") 
s

0    10
1    20
2    30
3    40
Name: Numbers, dtype: int64

In [10]:
#DataFrame
data = {
    "Name": ["Ali", "Ayşe", "Mehmet", "Zeynep", "Erhan", "Mustafa"],
    "Age": [25, 30, 22, 27, 23, 27],
    "City": ["İstanbul", "Ankara", "İzmir", "Bursa", "Antalya", "Konya"]
}
df = pd.DataFrame(data)
df

      Name  Age      City
0      Ali   25  İstanbul
1     Ayşe   30    Ankara
2   Mehmet   22     İzmir
3   Zeynep   27     Bursa
4    Erhan   23   Antalya
5  Mustafa   27     Konya

In [11]:
df.head() #ilk 5

     Name  Age      City
0     Ali   25  İstanbul
1    Ayşe   30    Ankara
2  Mehmet   22     İzmir
3  Zeynep   27     Bursa
4   Erhan   23   Antalya

In [12]:
df.tail(2) # Son 2

      Name  Age     City
4    Erhan   23  Antalya
5  Mustafa   27    Konya

In [13]:
df.info() #sutün tipleri

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [14]:
df.describe() #sayısal analiz

             Age
count   6.000000
mean   25.666667
std     2.943920
min    22.000000
25%    23.500000
50%    26.000000
75%    27.000000
max    30.000000

In [15]:
df["Name"]

0        Ali
1       Ayşe
2     Mehmet
3     Zeynep
4      Erhan
5    Mustafa
Name: Name, dtype: object

In [16]:
df[["Name", "Age"]]

      Name  Age
0      Ali   25
1     Ayşe   30
2   Mehmet   22
3   Zeynep   27
4    Erhan   23
5  Mustafa   27

In [17]:
df[df["Age"] > 25]

      Name  Age    City
1     Ayşe   30  Ankara
3   Zeynep   27   Bursa
5  Mustafa   27   Konya

In [18]:
df[(df["Age"] >= 25) & (df["City"] != "İstanbul")]

      Name  Age    City
1     Ayşe   30  Ankara
3   Zeynep   27   Bursa
5  Mustafa   27   Konya

In [19]:
#Yeni sütun ekleme
df["AgePlus5"] = df["Age"] + 5
df

      Name  Age      City  AgePlus5
0      Ali   25  İstanbul        30
1     Ayşe   30    Ankara        35
2   Mehmet   22     İzmir        27
3   Zeynep   27     Bursa        32
4    Erhan   23   Antalya        28
5  Mustafa   27     Konya        32

In [20]:
#0. satırdaki name
df.loc[0, "Name"]

'Ali'

In [21]:
#Tüm satırlar city sütunu
df.loc[:, "City"]

0    İstanbul
1      Ankara
2       İzmir
3       Bursa
4     Antalya
5       Konya
Name: City, dtype: object

In [22]:
#1. satır
df.iloc[1]

Name          Ayşe
Age             30
City        Ankara
AgePlus5        35
Name: 1, dtype: object

In [23]:
#ilk 3 satır, ilk 2 sütun
df.iloc[0:3, 0:2]

     Name  Age
0     Ali   25
1    Ayşe   30
2  Mehmet   22

In [24]:
df["NameLength"] = df["Name"].apply(lambda x: len(x))
df

      Name  Age      City  AgePlus5  NameLength
0      Ali   25  İstanbul        30           3
1     Ayşe   30    Ankara        35           4
2   Mehmet   22     İzmir        27           6
3   Zeynep   27     Bursa        32           6
4    Erhan   23   Antalya        28           5
5  Mustafa   27     Konya        32           7

In [27]:
df.loc[2, "Age"] = None #Boş değer oluşturur.
df.isnull().sum() #Kaç tane boş değer var

Name          0
Age           1
City          0
AgePlus5      0
NameLength    0
dtype: int64

In [28]:
df["Age"] = df["Age"].fillna(df["Age"].mean()) #Ortalama ile doldur
df

      Name   Age      City  AgePlus5  NameLength
0      Ali  25.0  İstanbul        30           3
1     Ayşe  30.0    Ankara        35           4
2   Mehmet  26.4     İzmir        27           6
3   Zeynep  27.0     Bursa        32           6
4    Erhan  23.0   Antalya        28           5
5  Mustafa  27.0     Konya        32           7

In [29]:
#Bir DataFrame oluşturup csv'ye kaydetme
df.to_csv("students.csv", index = False)

In [31]:
#csv' yi okuma
df2 = pd.read_csv("students.csv")
df2.head()

     Name   Age      City  AgePlus5  NameLength
0     Ali  25.0  İstanbul        30           3
1    Ayşe  30.0    Ankara        35           4
2  Mehmet  26.4     İzmir        27           6
3  Zeynep  27.0     Bursa        32           6
4   Erhan  23.0   Antalya        28           5

In [33]:
#Gruplama
df2["Score"] = [70, 85, 60, 90, 24, 65]
df2.groupby("City")["Score"].mean()

City
Ankara      85.0
Antalya     24.0
Bursa       90.0
Konya       65.0
İstanbul    70.0
İzmir       60.0
Name: Score, dtype: float64

In [34]:
#Sıralama
df2.sort_values(by = "Score", ascending = False)

      Name   Age      City  AgePlus5  NameLength  Score
3   Zeynep  27.0     Bursa        32           6     90
1     Ayşe  30.0    Ankara        35           4     85
0      Ali  25.0  İstanbul        30           3     70
5  Mustafa  27.0     Konya        32           7     65
2   Mehmet  26.4     İzmir        27           6     60
4    Erhan  23.0   Antalya        28           5     24

In [35]:
data = {
    "Product": ["Laptop", "Phone", "Tablet", "Monitor", "Keyboard"],
    "Price": [15000, 9000, 7000, 3000, 800],
    "Stock": [5, 10, 3, 7, 50],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Accessories"]
}

store = pd.DataFrame(data)
store

    Product  Price  Stock     Category
0    Laptop  15000      5  Electronics
1     Phone   9000     10  Electronics
2    Tablet   7000      3  Electronics
3   Monitor   3000      7  Electronics
4  Keyboard    800     50  Accessories

In [41]:
store[store["Price"] > 8000]

  Product  Price  Stock     Category
0  Laptop  15000      5  Electronics
1   Phone   9000     10  Electronics

In [42]:
store["TotalValue"] = store["Price"] * store["Stock"]
store

    Product  Price  Stock     Category  TotalValue
0    Laptop  15000      5  Electronics       75000
1     Phone   9000     10  Electronics       90000
2    Tablet   7000      3  Electronics       21000
3   Monitor   3000      7  Electronics       21000
4  Keyboard    800     50  Accessories       40000